Kecubunk/CUBE_Arduino_Core/esp8266/hardware/esp8266/2.3.0/boards.txt
menu.UploadSpeed=Upload Speed
menu.CpuFrequency=CPU Frequency
menu.FlashSize=Flash Size
menu.FlashMode=Flash Mode
menu.FlashFreq=Flash Frequency
menu.ResetMethod=Reset Method
menu.ESPModule=Module
menu.Debug=Debug port
menu.DebugLevel=Debug Level
menu.LwIPVariant=lwIP Variant

##############################################################
CUBE-01R.name=CUBE-01R

CUBE-01R.upload.tool=esptool
CUBE-01R.upload.speed=115200
CUBE-01R.upload.resetmethod=ck
CUBE-01R.upload.maximum_size=434160
CUBE-01R.upload.maximum_data_size=81920
CUBE-01R.upload.wait_for_upload_port=true
CUBE-01R.serial.disableDTR=true
CUBE-01R.serial.disableRTS=true

CUBE-01R.build.mcu=esp8266
CUBE-01R.build.f_cpu=80000000L
CUBE-01R.build.board=ESP8266_ESP01
CUBE-01R.build.core=esp8266
CUBE-01R.build.variant=CUBE-01R
CUBE-01R.build.flash_mode=qio
CUBE-01R.build.spiffs_pagesize=256
CUBE-01R.build.debug_port=
CUBE-01R.build.debug_level=

CUBE-01R.menu.CpuFrequency.80=80 MHz
CUBE-01R.menu.CpuFrequency.80.build.f_cpu=80000000L
CUBE-01R.menu.CpuFrequency.160=160 MHz
CUBE-01R.menu.CpuFrequency.160.build.f_cpu=160000000L

CUBE-01R.menu.FlashFreq.40=40MHz
CUBE-01R.menu.FlashFreq.40.build.flash_freq=40
CUBE-01R.menu.FlashFreq.80=80MHz
CUBE-01R.menu.FlashFreq.80.build.flash_freq=80

CUBE-01R.menu.FlashMode.dio=DIO
CUBE-01R.menu.FlashMode.dio.build.flash_mode=dio
CUBE-01R.menu.FlashMode.qio=QIO
CUBE-01R.menu.FlashMode.qio.build.flash_mode=qio
CUBE-01R.menu.FlashMode.dout=DOUT
CUBE-01R.menu.FlashMode.dout.build.flash_mode=dout
CUBE-01R.menu.FlashMode.qout=QOUT
CUBE-01R.menu.FlashMode.qout.build.flash_mode=qout

CUBE-01R.menu.UploadSpeed.115200=115200
CUBE-01R.menu.UploadSpeed.115200.upload.speed=115200
CUBE-01R.menu.UploadSpeed.9600=9600
CUBE-01R.menu.UploadSpeed.9600.upload.speed=9600
CUBE-01R.menu.UploadSpeed.57600=57600
CUBE-01R.menu.UploadSpeed.57600.upload.speed=57600
CUBE-01R.menu.UploadSpeed.256000.windows=256000
CUBE-01R.menu.UploadSpeed.256000.upload.speed=256000
CUBE-01R.menu.UploadSpeed.230400.linux=230400
CUBE-01R.menu.UploadSpeed.230400.macosx=230400
CUBE-01R.menu.UploadSpeed.230400.upload.speed=230400
CUBE-01R.menu.UploadSpeed.460800.linux=460800
CUBE-01R.menu.UploadSpeed.460800.macosx=460800
CUBE-01R.menu.UploadSpeed.460800.upload.speed=460800
CUBE-01R.menu.UploadSpeed.512000.windows=512000
CUBE-01R.menu.UploadSpeed.512000.upload.speed=512000
CUBE-01R.menu.UploadSpeed.921600=921600
CUBE-01R.menu.UploadSpeed.921600.upload.speed=921600

CUBE-01R.menu.FlashSize.512K64=512K (64K SPIFFS)
CUBE-01R.menu.FlashSize.512K64.build.flash_size=512K
CUBE-01R.menu.FlashSize.512K64.build.flash_ld=eagle.flash.512k64.ld
CUBE-01R.menu.FlashSize.512K64.build.spiffs_start=0x6B000
CUBE-01R.menu.FlashSize.512K64.build.spiffs_end=0x7B000
CUBE-01R.menu.FlashSize.512K64.build.spiffs_blocksize=4096
CUBE-01R.menu.FlashSize.512K64.upload.maximum_size=434160

CUBE-01R.menu.FlashSize.512K128=512K (128K SPIFFS)
CUBE-01R.menu.FlashSize.512K128.build.flash_size=512K
CUBE-01R.menu.FlashSize.512K128.build.flash_ld=eagle.flash.512k128.ld
CUBE-01R.menu.FlashSize.512K128.build.spiffs_start=0x5B000
CUBE-01R.menu.FlashSize.512K128.build.spiffs_end=0x7B000
CUBE-01R.menu.FlashSize.512K128.build.spiffs_blocksize=4096
CUBE-01R.menu.FlashSize.512K128.upload.maximum_size=368624

CUBE-01R.menu.FlashSize.512K0=512K (no SPIFFS)
CUBE-01R.menu.FlashSize.512K0.build.flash_size=512K
CUBE-01R.menu.FlashSize.512K0.build.flash_ld=eagle.flash.512k0.ld
CUBE-01R.menu.FlashSize.512K0.upload.maximum_size=499696

CUBE-01R.menu.FlashSize.1M512=1M (512K SPIFFS)
CUBE-01R.menu.FlashSize.1M512.build.flash_size=1M
CUBE-01R.menu.FlashSize.1M512.build.flash_ld=eagle.flash.1m512.ld
CUBE-01R.menu.FlashSize.1M512.build.spiffs_start=0x7B000
CUBE-01R.menu.FlashSize.1M512.build.spiffs_end=0xFB000
CUBE-01R.menu.FlashSize.1M512.build.spiffs_blocksize=8192
CUBE-01R.menu.FlashSize.1M512.upload.maximum_size=499696

CUBE-01R.menu.FlashSize.1M256=1M (256K SPIFFS)
CUBE-01R.menu.FlashSize.1M256.build.flash_size=1M
CUBE-01R.menu.FlashSize.1M256.build.flash_ld=eagle.flash.1m256.ld
CUBE-01R.menu.FlashSize.1M256.build.spiffs_start=0xBB000
CUBE-01R.menu.FlashSize.1M256.build.spiffs_end=0xFB000
CUBE-01R.menu.FlashSize.1M256.build.spiffs_blocksize=4096
CUBE-01R.menu.FlashSize.1M256.upload.maximum_size=761840

CUBE-01R.menu.FlashSize.1M192=1M (192K SPIFFS)
CUBE-01R.menu.FlashSize.1M192.build.flash_size=1M
CUBE-01R.menu.FlashSize.1M192.build.flash_ld=eagle.flash.1m192.ld
CUBE-01R.menu.FlashSize.1M192.build.spiffs_start=0xCB000
CUBE-01R.menu.FlashSize.1M192.build.spiffs_end=0xFB000
CUBE-01R.menu.FlashSize.1M192.build.spiffs_blocksize=4096
CUBE-01R.menu.FlashSize.1M192.upload.maximum_size=827376

CUBE-01R.menu.FlashSize.1M160=1M (160K SPIFFS)
CUBE-01R.menu.FlashSize.1M160.build.flash_size=1M
CUBE-01R.menu.FlashSize.1M160.build.flash_ld=eagle.flash.1m160.ld
CUBE-01R.menu.FlashSize.1M160.build.spiffs_start=0xD3000
CUBE-01R.menu.FlashSize.1M160.build.spiffs_end=0xFB000
CUBE-01R.menu.FlashSize.1M160.build.spiffs_blocksize=4096
CUBE-01R.menu.FlashSize.1M160.upload.maximum_size=860144

CUBE-01R.menu.FlashSize.1M144=1M (144K SPIFFS)
CUBE-01R.menu.FlashSize.1M144.build.flash_size=1M
CUBE-01R.menu.FlashSize.1M144.build.flash_ld=eagle.flash.1m144.ld
CUBE-01R.menu.FlashSize.1M144.build.spiffs_start=0xD7000
CUBE-01R.menu.FlashSize.1M144.build.spiffs_end=0xFB000
CUBE-01R.menu.FlashSize.1M144.build.spiffs_blocksize=4096
CUBE-01R.menu.FlashSize.1M144.upload.maximum_size=876528

CUBE-01R.menu.FlashSize.1M128=1M (128K SPIFFS)
CUBE-01R.menu.FlashSize.1M128.build.flash_size=1M
CUBE-01R.menu.FlashSize.1M128.build.flash_ld=eagle.flash.1m128.ld
CUBE-01R.menu.FlashSize.1M128.build.spiffs_start=0xDB000
CUBE-01R.menu.FlashSize.1M128.build.spiffs_end=0xFB000
CUBE-01R.menu.FlashSize.1M128.build.spiffs_blocksize=4096
CUBE-01R.menu.FlashSize.1M128.upload.maximum_size=892912

CUBE-01R.menu.FlashSize.1M64=1M (64K SPIFFS)
CUBE-01R.menu.FlashSize.1M64.build.flash_size=1M
CUBE-01R.menu.FlashSize.1M64.build.flash_ld=eagle.flash.1m64.ld
CUBE-01R.menu.FlashSize.1M64.build.spiffs_start=0xEB000
CUBE-01R.menu.FlashSize.1M64.build.spiffs_end=0xFB000
CUBE-01R.menu.FlashSize.1M64.build.spiffs_blocksize=4096
CUBE-01R.menu.FlashSize.1M64.upload.maximum_size=958448

