Kecubunk/CUBE_Arduino_Core/esp8266/hardware/esp8266/2.3.0/boards.txt
CUBE-01R.menu.ResetMethod.ck=ck
CUBE-01R.menu.ResetMethod.ck.upload.resetmethod=ck
CUBE-01R.menu.ResetMethod.nodemcu=nodemcu
CUBE-01R.menu.ResetMethod.nodemcu.upload.resetmethod=nodemcu

CUBE-01R.menu.Debug.Disabled=Disabled
CUBE-01R.menu.Debug.Disabled.build.debug_port=
CUBE-01R.menu.Debug.Serial=Serial
CUBE-01R.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
CUBE-01R.menu.Debug.Serial1=Serial1
CUBE-01R.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1

CUBE-01R.menu.DebugLevel.None____=None
CUBE-01R.menu.DebugLevel.None____.build.debug_level=
CUBE-01R.menu.DebugLevel.Core____=Core
CUBE-01R.menu.DebugLevel.Core____.build.debug_level=-DDEBUG_ESP_CORE
CUBE-01R.menu.DebugLevel.SSL_____=Core + SSL
CUBE-01R.menu.DebugLevel.SSL_____.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_SSL
CUBE-01R.menu.DebugLevel.SSL_MEM_=Core + SSL + TLS Mem
CUBE-01R.menu.DebugLevel.SSL_MEM_.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_SSL -DDEBUG_TLS_MEM
CUBE-01R.menu.DebugLevel.WiFic___=Core + WiFi
CUBE-01R.menu.DebugLevel.WiFic___.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI
CUBE-01R.menu.DebugLevel.WiFi____=WiFi
CUBE-01R.menu.DebugLevel.WiFi____.build.debug_level=-DDEBUG_ESP_WIFI
CUBE-01R.menu.DebugLevel.HTTPClient=HTTPClient
CUBE-01R.menu.DebugLevel.HTTPClient.build.debug_level=-DDEBUG_ESP_HTTP_CLIENT
CUBE-01R.menu.DebugLevel.HTTPClient2=HTTPClient + SSL
CUBE-01R.menu.DebugLevel.HTTPClient2.build.debug_level=-DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_SSL
CUBE-01R.menu.DebugLevel.HTTPUpdate=HTTPUpdate
CUBE-01R.menu.DebugLevel.HTTPUpdate.build.debug_level=-DDEBUG_ESP_HTTP_UPDATE
CUBE-01R.menu.DebugLevel.HTTPUpdate2=HTTPClient + HTTPUpdate
CUBE-01R.menu.DebugLevel.HTTPUpdate2.build.debug_level=-DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_HTTP_UPDATE
CUBE-01R.menu.DebugLevel.HTTPUpdate3=HTTPClient + HTTPUpdate + Updater
CUBE-01R.menu.DebugLevel.HTTPUpdate3.build.debug_level=-DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER
CUBE-01R.menu.DebugLevel.HTTPServer=HTTPServer
CUBE-01R.menu.DebugLevel.HTTPServer.build.debug_level=-DDEBUG_ESP_HTTP_SERVER
CUBE-01R.menu.DebugLevel.UPDATER=Updater
CUBE-01R.menu.DebugLevel.UPDATER.build.debug_level=-DDEBUG_ESP_UPDATER
CUBE-01R.menu.DebugLevel.OTA_____=OTA
CUBE-01R.menu.DebugLevel.OTA_____.build.debug_level=-DDEBUG_ESP_OTA
CUBE-01R.menu.DebugLevel.OTA2____=OTA + Updater
CUBE-01R.menu.DebugLevel.OTA2____.build.debug_level=-DDEBUG_ESP_OTA -DDEBUG_ESP_UPDATER
CUBE-01R.menu.DebugLevel.all_____=All
CUBE-01R.menu.DebugLevel.all_____.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_SSL -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_TLS_MEM

##############################################################
CUBE.name=CUBE-04R

CUBE.upload.tool=esptool
CUBE.upload.speed=460800
CUBE.upload.resetmethod=nodemcu
CUBE.upload.maximum_size=1044464
CUBE.upload.maximum_data_size=81920
CUBE.upload.wait_for_upload_port=true
CUBE.serial.disableDTR=true
CUBE.serial.disableRTS=true

CUBE.build.mcu=esp8266
CUBE.build.f_cpu=80000000L
CUBE.build.board=ESP8266_NODEMCU
CUBE.build.core=esp8266
CUBE.build.variant=CUBE
CUBE.build.flash_mode=dio
CUBE.build.flash_size=4M
CUBE.build.flash_freq=40
CUBE.build.debug_port=
CUBE.build.debug_level=

CUBE.menu.CpuFrequency.80=80 MHz
CUBE.menu.CpuFrequency.80.build.f_cpu=80000000L
CUBE.menu.CpuFrequency.160=160 MHz
CUBE.menu.CpuFrequency.160.build.f_cpu=160000000L

CUBE.menu.UploadSpeed.921600=921600
CUBE.menu.UploadSpeed.921600.upload.speed=921600
CUBE.menu.UploadSpeed.115200=115200
CUBE.menu.UploadSpeed.115200.upload.speed=115200
CUBE.menu.UploadSpeed.9600=9600
CUBE.menu.UploadSpeed.9600.upload.speed=9600
CUBE.menu.UploadSpeed.57600=57600
CUBE.menu.UploadSpeed.57600.upload.speed=57600
CUBE.menu.UploadSpeed.256000.windows=256000
CUBE.menu.UploadSpeed.256000.upload.speed=256000
CUBE.menu.UploadSpeed.230400.linux=230400
CUBE.menu.UploadSpeed.230400.macosx=230400
CUBE.menu.UploadSpeed.230400.macosx=230400
CUBE.menu.UploadSpeed.230400.upload.speed=230400
CUBE.menu.UploadSpeed.460800.linux=460800
CUBE.menu.UploadSpeed.460800.macosx=460800
CUBE.menu.UploadSpeed.460800.upload.speed=460800
CUBE.menu.UploadSpeed.512000.windows=512000
CUBE.menu.UploadSpeed.512000.upload.speed=512000


CUBE.menu.FlashSize.4M3M=4M (3M SPIFFS)
CUBE.menu.FlashSize.4M3M.build.flash_size=4M
CUBE.menu.FlashSize.4M3M.build.flash_ld=eagle.flash.4m.ld
CUBE.menu.FlashSize.4M3M.build.spiffs_start=0x100000
CUBE.menu.FlashSize.4M3M.build.spiffs_end=0x3FB000
CUBE.menu.FlashSize.4M3M.build.spiffs_blocksize=8192
CUBE.menu.FlashSize.4M3M.build.spiffs_pagesize=256

CUBE.menu.FlashSize.4M1M=4M (1M SPIFFS)
CUBE.menu.FlashSize.4M1M.build.flash_size=4M
CUBE.menu.FlashSize.4M1M.build.flash_ld=eagle.flash.4m1m.ld
CUBE.menu.FlashSize.4M1M.build.spiffs_start=0x300000
CUBE.menu.FlashSize.4M1M.build.spiffs_end=0x3FB000
CUBE.menu.FlashSize.4M1M.build.spiffs_blocksize=8192
CUBE.menu.FlashSize.4M1M.build.spiffs_pagesize=256

##############################################################
generic.name=Generic ESP8266 Module

generic.upload.tool=esptool
generic.upload.speed=115200
generic.upload.resetmethod=ck
generic.upload.maximum_size=434160
generic.upload.maximum_data_size=81920
generic.upload.wait_for_upload_port=true
generic.serial.disableDTR=true
generic.serial.disableRTS=true

generic.build.mcu=esp8266
generic.build.f_cpu=80000000L
generic.build.board=ESP8266_ESP01
generic.build.core=esp8266
generic.build.variant=generic
generic.build.flash_mode=qio
generic.build.spiffs_pagesize=256
generic.build.debug_port=
generic.build.debug_level=

generic.menu.CpuFrequency.80=80 MHz
generic.menu.CpuFrequency.80.build.f_cpu=80000000L
generic.menu.CpuFrequency.160=160 MHz
generic.menu.CpuFrequency.160.build.f_cpu=160000000L

generic.menu.FlashFreq.40=40MHz
generic.menu.FlashFreq.40.build.flash_freq=40
generic.menu.FlashFreq.80=80MHz
generic.menu.FlashFreq.80.build.flash_freq=80

generic.menu.FlashMode.dio=DIO
generic.menu.FlashMode.dio.build.flash_mode=dio
generic.menu.FlashMode.qio=QIO
generic.menu.FlashMode.qio.build.flash_mode=qio
generic.menu.FlashMode.dout=DOUT
generic.menu.FlashMode.dout.build.flash_mode=dout
generic.menu.FlashMode.qout=QOUT
generic.menu.FlashMode.qout.build.flash_mode=qout

generic.menu.UploadSpeed.115200=115200
generic.menu.UploadSpeed.115200.upload.speed=115200
generic.menu.UploadSpeed.9600=9600
generic.menu.UploadSpeed.9600.upload.speed=9600
generic.menu.UploadSpeed.57600=57600
generic.menu.UploadSpeed.57600.upload.speed=57600
generic.menu.UploadSpeed.256000.windows=256000
generic.menu.UploadSpeed.256000.upload.speed=256000
generic.menu.UploadSpeed.230400.linux=230400
generic.menu.UploadSpeed.230400.macosx=230400
generic.menu.UploadSpeed.230400.upload.speed=230400
generic.menu.UploadSpeed.460800.linux=460800
generic.menu.UploadSpeed.460800.macosx=460800
generic.menu.UploadSpeed.460800.upload.speed=460800
generic.menu.UploadSpeed.512000.windows=512000
generic.menu.UploadSpeed.512000.upload.speed=512000
generic.menu.UploadSpeed.921600=921600
generic.menu.UploadSpeed.921600.upload.speed=921600

generic.menu.FlashSize.512K64=512K (64K SPIFFS)
generic.menu.FlashSize.512K64.build.flash_size=512K
generic.menu.FlashSize.512K64.build.flash_ld=eagle.flash.512k64.ld
generic.menu.FlashSize.512K64.build.spiffs_start=0x6B000
generic.menu.FlashSize.512K64.build.spiffs_end=0x7B000
generic.menu.FlashSize.512K64.build.spiffs_blocksize=4096
generic.menu.FlashSize.512K64.upload.maximum_size=434160

